package org.example.lesson4.HomeWork;

public class Task2 {
    public static void main(String[] args) {
//        Учитывая строку s, содержащую только символы '(', ')', '{', и '}', определите, допустима ли входная строка.'['']'
//
//        Входная строка действительна, если:
//
//        Открытые скобки должны быть закрыты однотипными скобками.
//                Открытые скобки должны быть закрыты в правильном порядке.
//                Каждой закрывающей скобке соответствует открытая скобка того же типа.
//
//        Пример 1:
//
//        Ввод: s = "()"
//        Вывод: правда


    }
}
